{
  "_name_or_path": "mistralai/Mistral-7B-v0.1",
  "architectures": [
    "SparseMistralforCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    	  "AutoConfig":"ugly_utils.SparseMistralConfig",
	  "AutoModelForCausalLM": "ugly_utils.SparseMistralforCausalLM"
  },
  "bos_token_id": 1,
  "eos_token_id": 2,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "max_position_embeddings": 32768,
  "mlp_bias": false,
  "model_type": "sparse_mistral",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "sliding_window": 4096,
  "thresholds": [
    0.023069201037287712,
    0.03109327331185341,
    0.04513540118932724,
    0.05516548827290535,
    0.07121363282203674,
    0.08324974030256271,
    0.09127381443977356,
    0.0992978885769844,
    0.10330992192029953,
    0.10732196271419525,
    0.11133399605751038,
    0.1153460294008255,
    0.11935807019472122,
    0.12337010353803635,
    0.13540621101856232,
    0.14744232594966888,
    0.16349045932292938,
    0.1735205501317978,
    0.18555666506290436,
    0.19759276509284973,
    0.21163490414619446,
    0.22768303751945496,
    0.225677028298378,
    0.23370109498500824,
    0.23771312832832336,
    0.23771312832832336,
    0.2357071191072464,
    0.2357071191072464,
    0.2357071191072464,
    0.23370109498500824,
    0.2357071191072464,
    0.24373118579387665
  ],
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.44.2",
  "us_sparse_regularization": false,
  "use_cache": false,
  "use_graceful_regularization": false,
  "use_relu": false,
  "use_sparse_model": true,
  "use_sparse_predictor": false,
  "use_sparse_regularization": false,
  "vocab_size": 32000
}
